#pragma once
#include "AssemblyCSharp.hpp"
#include "../../Features/Features/Features.hpp"
#include "../../Features/Notifications/Notifications.hpp"


namespace O::Projectile {
	constexpr auto initialVelocity = 0x18;
	constexpr auto drag = 0x24;
	constexpr auto gravityModifier = 0x28;
	constexpr auto thickness = 0x2C;
	constexpr auto initialDistance = 0x30;
	constexpr auto remainInWorld = 0x34;
	constexpr auto stickProbability = 0x38;
	constexpr auto breakProbability = 0x3C;
	constexpr auto conditionLoss = 0x40;
	constexpr auto ricochetChance = 0x44;
	constexpr auto penetrationPower = 0x48;
	constexpr auto waterIntegrityLoss = 0x4C;
	constexpr auto damageProperties = 0x50;
	constexpr auto damageDistances = 0x58;
	constexpr auto createDecals = 0x80;
	constexpr auto doDefaultHitEffects = 0x81;
	constexpr auto flybySound = 0x88;
	constexpr auto flybySoundDistance = 0x90;
	constexpr auto closeFlybySound = 0x98;
	constexpr auto closeFlybyDistance = 0xA0;
	constexpr auto tumbleSpeed = 0xA4;
	constexpr auto tumbleAxis = 0xA8;
	constexpr auto swimScale = 0xB4;
	constexpr auto swimSpeed = 0xC0;
	constexpr auto owner = 0xD0;
	constexpr auto sourceWeaponPrefab = 0xD8;
	constexpr auto sourceProjectilePrefab = 0xE0;
	constexpr auto mod = 0xE8;
	constexpr auto projectileID = 0xF0;
	constexpr auto seed = 0xF4;
	constexpr auto clientsideEffect = 0xF8;
	constexpr auto clientsideAttack = 0xF9;
	constexpr auto integrity = 0xFC;
	constexpr auto maxDistance = 0x100;
	constexpr auto modifier = 0x104;
	constexpr auto invisible = 0x114;
	constexpr auto currentVelocity = 0x118;
	constexpr auto currentPosition = 0x124;
	constexpr auto traveledDistance = 0x130;
	constexpr auto traveledTime = 0x134;
	constexpr auto launchTime = 0x138;
	constexpr auto sentPosition = 0x13C;
	constexpr auto previousPosition = 0x148;
	constexpr auto previousVelocity = 0x154;
	constexpr auto previousTraveledTime = 0x160;
	constexpr auto isUnderwater = 0x164;
	constexpr auto isRicochet = 0x165;
	constexpr auto isRetiring = 0x166;
	constexpr auto flybyPlayed = 0x167;
	constexpr auto wasFacingPlayer = 0x168;
	constexpr auto flybyPlane = 0x16C;
	constexpr auto flybyRay = 0x17C;
	constexpr auto cleanupAction = 0x198;
	constexpr auto hitTest = 0x1A0;
	constexpr auto swimRandom = 0x1A8;
	constexpr auto _waterMaterialID = 0x4;
	constexpr auto cachedWaterString = 0x8;
};

template<typename t>
t read(uintptr_t addr) {
	if (addr < 0xffffff)
		return t();
	if (addr > 0x7fffffff0000)
		return t();

	return *reinterpret_cast<t*>(addr);
}

template<typename t>
bool write(uintptr_t addr, t buffer) {
	*reinterpret_cast<t*>(addr) = buffer;
	return true;
}


#define safe_read(Addr, Type) read<Type>((DWORD64)Addr)
#define safe_write(Addr, Data, Type) write<Type>((DWORD64)Addr, Data);

class Projectile_c : AssemblyCSharp::Projectile {
public:
	IL2CPP_CLASS("Projectile");
	IL2CPP_FIELD(float, thickness);
	IL2CPP_FIELD(Vector3, currentPosition);
	IL2CPP_FIELD(Vector3, sentPosition);

	IL2CPP_FIELD(Vector3, currentVelocity);
	IL2CPP_FIELD(Vector3, initialVelocity);
	IL2CPP_FIELD(Vector3, previousPosition);
	IL2CPP_FIELD(Vector3, previousVelocity);
	IL2CPP_FIELD(AssemblyCSharp::HitTest*, hitTest);
	IL2CPP_FIELD(float, traveledTime);
	IL2CPP_FIELD(float, traveledDistance);
	IL2CPP_FIELD(float, gravityModifier);
	IL2CPP_FIELD(float, drag);
	IL2CPP_FIELD(float, closeFlybyDistance);
	IL2CPP_FIELD(float, tumbleSpeed);
	IL2CPP_FIELD(float, maxDistance);
	IL2CPP_FIELD(bool, createDecals);
	IL2CPP_FIELD(Vector3, tumbleAxis);
	IL2CPP_FIELD(float, previousTraveledTime);
	IL2CPP_FIELD(float, launchTime);
	IL2CPP_FIELD(Vector3, swimScale);
	IL2CPP_FIELD(float, penetrationPower);
	IL2CPP_FIELD(int, seed);
	IL2CPP_FIELD(float, flybySoundDistance);
	IL2CPP_FIELD(float, swimRandom);
	IL2CPP_FIELD(Vector3, swimSpeed);

	IL2CPP_FIELD(int, projectileID);
	IL2CPP_FIELD(float, initialDistance);
	IL2CPP_FIELD(float, integrity);
	IL2CPP_FIELD(AssemblyCSharp::BasePlayer*, owner);
	IL2CPP_FIELD(bool, isRicochet);
	IL2CPP_FIELD(AssemblyCSharp::AttackEntity*, sourceWeaponPrefab);
	IL2CPP_FIELD(AssemblyCSharp::DamageProperties*, damageProperties);
	IL2CPP_FIELD(float, ricochetChance);

	bool IsAlive() {
		return (this->integrity() > 0.001f && this->traveledDistance() < this->maxDistance());
	}

	struct TraceInfo {

		bool valid; // 0x0
		float distance; // 0x4
		DWORD64 entity; // 0x8   //BasePlayer
		Vector3 point; // 0x10
		Vector3 normal; // 0x1C
		DWORD64/*Transform*/ bone; // 0x28
		DWORD64 material; // 0x30
		unsigned int partID; // 0x38
		DWORD64 collider; // 0x40
	};

	void SimulateProjectile(Vector3 position, Vector3 velocity, float partialTime, float travelTime, Vector3 gravity, float drag,  Vector3 prevPosition,  Vector3 prevVelocity)
	{
		float num = 0.03125f;
		prevPosition = position;
		prevVelocity = velocity;
		if (partialTime > 0)
		{
			float num2 = num - partialTime;
			if (travelTime < num2)
			{
				prevPosition = position;
				prevVelocity = velocity;
				position += velocity * travelTime;
				partialTime += travelTime;
				return;
			}
			prevPosition = position;
			prevVelocity = velocity;
			position += velocity * num2;
			velocity += gravity * num;
			velocity -= velocity * (drag * num);
			travelTime -= num2;
		}
		int num3 = int(travelTime / num);
		for (int i = 0; i < num3; i++)
		{
			prevPosition = position;
			prevVelocity = velocity;
			position += velocity * num;
			velocity += gravity * num;
			velocity -= velocity * (drag * num);
		}
		partialTime = travelTime - num * (float)num3;
